espressif/arduino-esp32/tools/ide-debug/svd/esp8266.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>IO_MUX</name>
      <baseAddress>0x60000800</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00000220</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>IO_MUX_CONF</name>
          <addressOffset>0x0</addressOffset>
          <description>IO_MUX_CONF</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SPI0_CLK_EQU_SYS_CLK</name>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI1_CLK_EQU_SYS_CLK</name>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IO_MUX_MTDI</name>
          <addressOffset>0x4</addressOffset>
          <description>IO_MUX_MTDI</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>Register</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IO_MUX_MTCK</name>
          <addressOffset>0x8</addressOffset>
          <description>IO_MUX_MTCK</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>Register</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IO_MUX_MTMS</name>
          <addressOffset>0xc</addressOffset>
          <description>IO_MUX_MTMS</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>Register</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IO_MUX_MTDO</name>
          <addressOffset>0x10</addressOffset>
          <description>IO_MUX_MTDO</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>Register</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IO_MUX_U0RXD</name>
          <addressOffset>0x14</addressOffset>
          <description>IO_MUX_U0RXD</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>Register</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IO_MUX_U0TXD</name>
          <addressOffset>0x18</addressOffset>
          <description>IO_MUX_U0TXD</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>Register</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IO_MUX_SD_CLK</name>
          <addressOffset>0x1c</addressOffset>
          <description>IO_MUX_SD_CLK</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>Register</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IO_MUX_SD_DATA0</name>
          <addressOffset>0x20</addressOffset>
          <description>IO_MUX_SD_DATA0</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>Register</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IO_MUX_SD_DATA1</name>
          <addressOffset>0x24</addressOffset>
          <description>IO_MUX_SD_DATA1</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>Register</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IO_MUX_SD_DATA2</name>
          <addressOffset>0x28</addressOffset>
          <description>IO_MUX_SD_DATA2</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>Register</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IO_MUX_SD_DATA3</name>
          <addressOffset>0x2c</addressOffset>
          <description>IO_MUX_SD_DATA3</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>Register</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IO_MUX_SD_CMD</name>
          <addressOffset>0x30</addressOffset>
          <description>IO_MUX_SD_CMD</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>Register</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IO_MUX_GPIO0</name>
          <addressOffset>0x34</addressOffset>
          <description>IO_MUX_GPIO0</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>Register</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IO_MUX_GPIO2</name>
          <addressOffset>0x38</addressOffset>
          <description>IO_MUX_GPIO2</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>Register</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IO_MUX_GPIO4</name>
          <addressOffset>0x3c</addressOffset>
          <description>IO_MUX_GPIO4</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>Register</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IO_MUX_GPIO5</name>
          <addressOffset>0x40</addressOffset>
          <description>IO_MUX_GPIO5</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>Register</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
