espressif/arduino-esp32/tools/ide-debug/svd/esp8266.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SPI0</name>
      <baseAddress>0x60000200</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00000400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>SPI_CMD</name>
          <addressOffset>0x0</addressOffset>
          <description>In the master mode, it is the start bit of a single operation. Self-clear by hardware</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>spi_usr</name>
              <description>In the master mode, it is the start bit of a single operation. Self-clear by hardware</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_ADDR</name>
          <addressOffset>0x4</addressOffset>
          <description>In the master mode, it is the value of address in "address"  phase.</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>iodata_start_addr</name>
              <description>In the master mode, it is the value of address in "address"  phase.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_CTRL</name>
          <addressOffset>0x8</addressOffset>
          <description>SPI_CTRL</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>spi_wr_bit_order</name>
              <description>In "command", "address", "write-data" (MOSI) phases, 1: LSB first; 0: MSB first</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>spi_rd_bit_order</name>
              <description>In "read-data" (MISO) phase, 1: LSB first; 0: MSB first</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>spi_qio_mode</name>
              <description>In the read operations, "address" phase and "read-data" phase apply 4 signals</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>spi_dio_mode</name>
              <description>In the read operations, "address" phase and "read-data" phase apply 2 signals</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>spi_qout_mode</name>
              <description>In the read operations, "read-data" phase apply 4 signals</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>spi_dout_mode</name>
              <description>In the read operations, "read-data" phase apply 2 signals</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>spi_fastrd_mode</name>
              <description>this bit enable the bits: spi_qio_mode, spi_dio_mode, spi_qout_mode and spi_dout_mode</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_RD_STATUS</name>
          <addressOffset>0x10</addressOffset>
          <description>In the slave mode, this register are the status register for the master to read out.</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>slv_rd_status</name>
              <description>In the slave mode, this register are the status register for the master to read out.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_CTRL2</name>
          <addressOffset>0x14</addressOffset>
          <description>spi_cs signal is delayed by 80MHz clock cycles</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>spi_cs_delay_num</name>
              <description>spi_cs signal is delayed by 80MHz clock cycles</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>spi_cs_delay_mode</name>
              <description>spi_cs signal is delayed by spi_clk. 0: zero; 1: half cycle; 2: one cycle</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>spi_mosi_delay_num</name>
              <description>MOSI signals are delayed by 80MHz clock cycles</description>
              <bitOffset>23</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>spi_mosi_delay_mode</name>
              <description>MOSI signals are delayed by spi_clk. 0: zero; 1: half cycle; 2: one cycle</description>
              <bitOffset>21</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>spi_miso_delay_num</name>
              <description>MISO signals are delayed by 80MHz clock cycles</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>spi_miso_delay_mode</name>
              <description>MISO signals are delayed by spi_clk. 0: zero; 1: half cycle; 2: one cycle</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_CLOCK</name>
          <addressOffset>0x18</addressOffset>
          <description>In the master mode, 1: spi_clk is eqaul to 80MHz, 0: spi_clk is divided from 80 MHz clock.</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>spi_clk_equ_sysclk</name>
              <description>In the master mode, 1: spi_clk is eqaul to 80MHz, 0: spi_clk is divided from 80 MHz clock.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>spi_clkdiv_pre</name>
              <description>In the master mode, it is pre-divider of spi_clk.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>spi_clkcnt_N</name>
              <description>In the master mode, it is the divider of spi_clk. So spi_clk frequency is 80MHz/(spi_clkdiv_pre+1)/(spi_clkcnt_N+1)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>spi_clkcnt_H</name>
              <description>In the master mode, it must be floor((spi_clkcnt_N+1)/2-1). In the slave mode, it must be 0.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>spi_clkcnt_L</name>
              <description>In the master mode, it must be eqaul to spi_clkcnt_N. In the slave mode, it must be 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_USER</name>
          <addressOffset>0x1c</addressOffset>
          <description>This bit enable the "command" phase of an operation.</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>spi_usr_command</name>
              <description>This bit enable the "command" phase of an operation.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>spi_usr_addr</name>
              <description>This bit enable the "address" phase of an operation.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>spi_usr_dummy</name>
              <description>This bit enable the "dummy" phase of an operation.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>spi_usr_miso</name>
              <description>This bit enable the "read-data" phase of an operation.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>spi_usr_mosi</name>
              <description>This bit enable the "write-data" phase of an operation.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>reg_usr_mosi_highpart</name>
              <description>1: "write-data" phase only access to high-part of the buffer spi_w8~spi_w15</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>reg_usr_miso_highpart</name>
              <description>1: "read-data" phase only access to high-part of the buffer spi_w8~spi_w15</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>spi_sio</name>
              <description>1: mosi and miso signals share the same pin</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>spi_fwrite_qio</name>
              <description>In the write operations, "address" phase and "read-data" phase apply 4 signals</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>spi_fwrite_dio</name>
              <description>In the write operations, "address" phase and "read-data" phase apply 2 signals</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>spi_fwrite_quad</name>
              <description>In the write operations, "read-data" phase apply 4 signals</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>spi_fwrite_dual</name>
              <description>In the write operations, "read-data" phase apply 2 signals</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>spi_wr_byte_order</name>
              <description>In "command", "address", "write-data" (MOSI) phases, 1: little-endian; 0: big_endian</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>spi_rd_byte_order</name>
              <description>In "read-data" (MISO) phase, 1: little-endian; 0: big_endian</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>spi_ck_i_edge</name>
              <description>In the slave mode, 1: rising-edge; 0: falling-edge</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_USER1</name>
          <addressOffset>0x20</addressOffset>
          <description>The length in bits of "address" phase. The register value shall be (bit_num-1)</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>reg_usr_addr_bitlen</name>
              <description>The length in bits of "address" phase. The register value shall be (bit_num-1)</description>
              <bitOffset>26</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>reg_usr_mosi_bitlen</name>
              <description>The length in bits of "write-data" phase. The register value shall be (bit_num-1)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>reg_usr_miso_bitlen</name>
              <description>The length in bits of "read-data" phase. The register value shall be (bit_num-1)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>reg_usr_dummy_cyclelen</name>
              <description>The length in spi_clk cycles of "dummy" phase. The register value shall be (cycle_num-1)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_USER2</name>
          <addressOffset>0x24</addressOffset>
          <description>The length in bits of "command" phase. The register value shall be (bit_num-1)</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>reg_usr_command_bitlen</name>
              <description>The length in bits of "command" phase. The register value shall be (bit_num-1)</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>reg_usr_command_value</name>
              <description>The value of "command" phase</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_WR_STATUS</name>
          <addressOffset>0x28</addressOffset>
          <description>In the slave mode, this register are the status register for the master to write into.</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>slv_wr_status</name>
              <description>In the slave mode, this register are the status register for the master to write into.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_PIN</name>
          <addressOffset>0x2c</addressOffset>
          <description>1: disable CS2; 0: spi_cs signal is from/to CS2 pin</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>spi_cs2_dis</name>
              <description>1: disable CS2; 0: spi_cs signal is from/to CS2 pin</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>spi_cs1_dis</name>
              <description>1: disable CS1; 0: spi_cs signal is from/to CS1 pin</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>spi_cs0_dis</name>
              <description>1: disable CS0; 0: spi_cs signal is from/to CS0 pin</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_SLAVE</name>
          <addressOffset>0x30</addressOffset>
          <description>It is the synchronous reset signal of the module. This bit is self-cleared by hardware.</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>spi_sync_reset</name>
              <description>It is the synchronous reset signal of the module. This bit is self-cleared by hardware.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>spi_slave_mode</name>
              <description>1: slave mode, 0: master mode.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>slv_cmd_define</name>
              <description>1: slave mode commands are defined in SPI_SLAVE3. 0: slave mode commands are fixed as 1: "write-status"; 4: "read-status"; 2: "write-buffer" and 3: "read-buffer".</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>spi_trans_cnt</name>
              <description>The operations counter in both the master mode and the slave mode.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>spi_int_en</name>
              <description>Interrupt enable bits for the below 5 sources</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>spi_trans_done</name>
              <description>The interrupt raw bit for the completement of any operation in both the master mode and the slave mode.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>slv_wr_sta_done</name>
              <description>The interrupt raw bit for the completement of "write-status" operation in the slave mode.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>slv_rd_sta_done</name>
              <description>The interrupt raw bit for the completement of "read-status" operation in the slave mode.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>slv_wr_buf_done</name>
              <description>The interrupt raw bit for the completement of "write-buffer" operation in the slave mode.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>slv_rd_buf_done</name>
              <description>The interrupt raw bit for the completement of "read-buffer" operation in the slave mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
