espressif/arduino-esp32/tools/ide-debug/svd/esp8266.svd
        <register>
          <name>SPI_SLAVE1</name>
          <addressOffset>0x34</addressOffset>
          <description>In the slave mode, it is the length in bits for "write-status" and "read-status" operations. The register valueshall be (bit_num-1)</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>slv_status_bitlen</name>
              <description>In the slave mode, it is the length in bits for "write-status" and "read-status" operations. The register valueshall be (bit_num-1)</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>slv_buf_bitlen</name>
              <description>In the slave mode, it is the length in bits for "write-buffer" and "read-buffer" operations. The register value shallbe (bit_num-1)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>slv_rd_addr_bitlen</name>
              <description>In the slave mode, it is the address length in bits for "read-buffer" operation. The register value shall be(bit_num-1)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>slv_wr_addr_bitlen</name>
              <description>In the slave mode, it is the address length in bits for "write-buffer" operation. The register value shall be(bit_num-1)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>slv_wrsta_dummy_en</name>
              <description>In the slave mode, it is the enable bit of "dummy" phase for "write-status" operations.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>slv_rdsta_dummy_en</name>
              <description>In the slave mode, it is the enable bit of "dummy" phase for "read-status" operations.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>slv_wrbuf_dummy_en</name>
              <description>In the slave mode, it is the enable bit of "dummy" phase for "write-buffer" operations.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>slv_rdbuf_dummy_en</name>
              <description>In the slave mode, it is the enable bit of "dummy" phase for "read-buffer" operations.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_SLAVE2</name>
          <addressOffset>0x38</addressOffset>
          <description>In the slave mode, it is the length in spi_clk cycles "dummy" phase for "write-buffer" operations. The registervalue shall be (cycle_num-1)</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>slv_wrbuf_dummy_cyclelen</name>
              <description>In the slave mode, it is the length in spi_clk cycles "dummy" phase for "write-buffer" operations. The registervalue shall be (cycle_num-1)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>slv_rdbuf_dummy_cyclelen</name>
              <description>In the slave mode, it is the length in spi_clk cycles of "dummy" phase for "read-buffer" operations. The registervalue shall be (cycle_num-1)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>slv_wrsta_dummy_cyclelen</name>
              <description>In the slave mode, it is the length in spi_clk cycles of "dummy" phase for "write-status" operations. Theregister value shall be (cycle_num-1)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>slv_rdsta_dummy_cyclelen</name>
              <description>In the slave mode, it is the length in spi_clk cycles of "dummy" phase for "read-status" operations. Theregister value shall be (cycle_num-1)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_SLAVE3</name>
          <addressOffset>0x3c</addressOffset>
          <description>In slave mode, it is the value of "write-status" command</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>slv_wrsta_cmd_value</name>
              <description>In slave mode, it is the value of "write-status" command</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>slv_rdsta_cmd_value</name>
              <description>In slave mode, it is the value of "read-status" command</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>slv_wrbuf_cmd_value</name>
              <description>In slave mode, it is the value of "write-buffer" command</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>slv_rdbuf_cmd_value</name>
              <description>In slave mode, it is the value of "read-buffer" command</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_EXT3</name>
          <addressOffset>0xfc</addressOffset>
          <description>This register is for two SPI masters to share the same cs, clock and data signals.</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>reg_int_hold_ena</name>
              <description>This register is for two SPI masters to share the same cs, clock and data signals.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_W0</name>
          <addressOffset>0x40</addressOffset>
          <description>the data inside the buffer of the SPI module, word 0</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>spi_w0</name>
              <description>the data inside the buffer of the SPI module, word 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_W1</name>
          <addressOffset>0x44</addressOffset>
          <description>the data inside the buffer of the SPI module, word 1</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>spi_w1</name>
              <description>the data inside the buffer of the SPI module, word 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_W2</name>
          <addressOffset>0x48</addressOffset>
          <description>the data inside the buffer of the SPI module, word 2</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>spi_w2</name>
              <description>the data inside the buffer of the SPI module, word 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_W3</name>
          <addressOffset>0x4c</addressOffset>
          <description>the data inside the buffer of the SPI module, word 3</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>spi_w3</name>
              <description>the data inside the buffer of the SPI module, word 3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_W4</name>
          <addressOffset>0x50</addressOffset>
          <description>the data inside the buffer of the SPI module, word 4</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>spi_w4</name>
              <description>the data inside the buffer of the SPI module, word 4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_W5</name>
          <addressOffset>0x54</addressOffset>
          <description>the data inside the buffer of the SPI module, word 5</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>spi_w5</name>
              <description>the data inside the buffer of the SPI module, word 5</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_W6</name>
          <addressOffset>0x58</addressOffset>
          <description>the data inside the buffer of the SPI module, word 6</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>spi_w6</name>
              <description>the data inside the buffer of the SPI module, word 6</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_W7</name>
          <addressOffset>0x5c</addressOffset>
          <description>the data inside the buffer of the SPI module, word 7</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>spi_w7</name>
              <description>the data inside the buffer of the SPI module, word 7</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_W8</name>
          <addressOffset>0x60</addressOffset>
          <description>the data inside the buffer of the SPI module, word 8</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>spi_w8</name>
              <description>the data inside the buffer of the SPI module, word 8</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_W9</name>
          <addressOffset>0x64</addressOffset>
          <description>the data inside the buffer of the SPI module, word 9</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>spi_w9</name>
              <description>the data inside the buffer of the SPI module, word 9</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_W10</name>
          <addressOffset>0x68</addressOffset>
          <description>the data inside the buffer of the SPI module, word 10</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>spi_w10</name>
              <description>the data inside the buffer of the SPI module, word 10</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_W11</name>
          <addressOffset>0x6c</addressOffset>
          <description>the data inside the buffer of the SPI module, word 11</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>spi_w11</name>
              <description>the data inside the buffer of the SPI module, word 11</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_W12</name>
          <addressOffset>0x70</addressOffset>
          <description>the data inside the buffer of the SPI module, word 12</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>spi_w12</name>
              <description>the data inside the buffer of the SPI module, word 12</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_W13</name>
          <addressOffset>0x74</addressOffset>
          <description>the data inside the buffer of the SPI module, word 13</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>spi_w13</name>
              <description>the data inside the buffer of the SPI module, word 13</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_W14</name>
          <addressOffset>0x78</addressOffset>
          <description>the data inside the buffer of the SPI module, word 14</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>spi_w14</name>
              <description>the data inside the buffer of the SPI module, word 14</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_W15</name>
          <addressOffset>0x7c</addressOffset>
          <description>the data inside the buffer of the SPI module, word 15</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>spi_w15</name>
              <description>the data inside the buffer of the SPI module, word 15</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
