espressif/arduino-esp32/tools/ide-debug/svd/esp8266.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>UART0</name>
      <baseAddress>0x60000000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x000001e0</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>UART_FIFO</name>
          <addressOffset>0x0</addressOffset>
          <description>UART FIFO,length 128</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>rxfifo_rd_byte</name>
              <description>R/W share the same address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_INT_RAW</name>
          <addressOffset>0x4</addressOffset>
          <description>UART INTERRUPT RAW STATE</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>rxfifo_tout_int_raw</name>
              <description>The interrupt raw bit for Rx time-out interrupt(depands on theUART_RX_TOUT_THRHD)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>brk_det_int_raw</name>
              <description>The interrupt raw bit for Rx byte start error</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>cts_chg_int_raw</name>
              <description>The interrupt raw bit for CTS changing level</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>dsr_chg_int_raw</name>
              <description>The interrupt raw bit for DSR changing level</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>rxfifo_ovf_int_raw</name>
              <description>The interrupt raw bit for rx fifo overflow</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>frm_err_int_raw</name>
              <description>The interrupt raw bit for other rx error</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>parity_err_int_raw</name>
              <description>The interrupt raw bit for parity check error</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>txfifo_empty_int_raw</name>
              <description>The interrupt raw bit for tx fifo empty interrupt(depands onUART_TXFIFO_EMPTY_THRHD bits)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>rxfifo_full_int_raw</name>
              <description>The interrupt raw bit for rx fifo full interrupt(depands onUART_RXFIFO_FULL_THRHD bits)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_INT_ST</name>
          <addressOffset>0x8</addressOffset>
          <description>UART INTERRUPT STATEREGISTERUART_INT_RAW&amp;UART_INT_ENA</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>rxfifo_tout_int_st</name>
              <description>The interrupt state bit for Rx time-out event</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>brk_det_int_st</name>
              <description>The interrupt state bit for rx byte start error</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>cts_chg_int_st</name>
              <description>The interrupt state bit for CTS changing level</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>dsr_chg_int_st</name>
              <description>The interrupt state bit for DSR changing level</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>rxfifo_ovf_int_st</name>
              <description>The interrupt state bit for RX fifo overflow</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>frm_err_int_st</name>
              <description>The interrupt state for other rx error</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>parity_err_int_st</name>
              <description>The interrupt state bit for rx parity error</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>txfifo_empty_int_st</name>
              <description>The interrupt state bit for TX fifo empty</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>rxfifo_full_int_st</name>
              <description>The interrupt state bit for RX fifo full event</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_INT_ENA</name>
          <addressOffset>0xc</addressOffset>
          <description>UART INTERRUPT ENABLE REGISTER</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>rxfifo_tout_int_ena</name>
              <description>The interrupt enable bit for rx time-out interrupt</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>brk_det_int_ena</name>
              <description>The interrupt enable bit for rx byte start error</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>cts_chg_int_ena</name>
              <description>The interrupt enable bit for CTS changing level</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>dsr_chg_int_ena</name>
              <description>The interrupt enable bit for DSR changing level</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rxfifo_ovf_int_ena</name>
              <description>The interrupt enable bit for rx fifo overflow</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>frm_err_int_ena</name>
              <description>The interrupt enable bit for other rx error</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>parity_err_int_ena</name>
              <description>The interrupt enable bit for parity error</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>txfifo_empty_int_ena</name>
              <description>The interrupt enable bit for tx fifo empty event</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rxfifo_full_int_ena</name>
              <description>The interrupt enable bit for rx fifo full event</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_INT_CLR</name>
          <addressOffset>0x10</addressOffset>
          <description>UART INTERRUPT CLEAR REGISTER</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>rxfifo_tout_int_clr</name>
              <description>Set this bit to clear the rx time-out interrupt</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>brk_det_int_clr</name>
              <description>Set this bit to clear the rx byte start interrupt</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>cts_chg_int_clr</name>
              <description>Set this bit to clear the CTS changing interrupt</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>dsr_chg_int_clr</name>
              <description>Set this bit to clear the DSR changing interrupt</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>rxfifo_ovf_int_clr</name>
              <description>Set this bit to clear the rx fifo over-flow interrupt</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>frm_err_int_clr</name>
              <description>Set this bit to clear other rx error interrupt</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>parity_err_int_clr</name>
              <description>Set this bit to clear the parity error interrupt</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>txfifo_empty_int_clr</name>
              <description>Set this bit to clear the tx fifo empty interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>rxfifo_full_int_clr</name>
              <description>Set this bit to clear the rx fifo full interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_CLKDIV</name>
          <addressOffset>0x14</addressOffset>
          <description>UART CLK DIV REGISTER</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>uart_clkdiv</name>
              <description>BAUDRATE = UART_CLK_FREQ / UART_CLKDIV</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_AUTOBAUD</name>
          <addressOffset>0x18</addressOffset>
          <description>UART BAUDRATE DETECT REGISTER</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>glitch_filt</name>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>autobaud_en</name>
              <description>Set this bit to enable baudrate detect</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_STATUS</name>
          <addressOffset>0x1c</addressOffset>
          <description>UART STATUS REGISTER</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>txd</name>
              <description>The level of the uart txd pin</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>rtsn</name>
              <description>The level of uart rts pin</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>dtrn</name>
              <description>The level of uart dtr pin</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>txfifo_cnt</name>
              <description>Number of data in UART TX fifo</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>rxd</name>
              <description>The level of uart rxd pin</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ctsn</name>
              <description>The level of uart cts pin</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>dsrn</name>
              <description>The level of uart dsr pin</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>rxfifo_cnt</name>
              <description>Number of data in uart rx fifo</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_CONF0</name>
          <addressOffset>0x20</addressOffset>
          <description>UART CONFIG0(UART0 and UART1)</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>uart_dtr_inv</name>
              <description>Set this bit to inverse uart dtr level</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>uart_rts_inv</name>
              <description>Set this bit to inverse uart rts level</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>uart_txd_inv</name>
              <description>Set this bit to inverse uart txd level</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>uart_dsr_inv</name>
              <description>Set this bit to inverse uart dsr level</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>uart_cts_inv</name>
              <description>Set this bit to inverse uart cts level</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>uart_rxd_inv</name>
              <description>Set this bit to inverse uart rxd level</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>txfifo_rst</name>
              <description>Set this bit to reset uart tx fifo</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rxfifo_rst</name>
              <description>Set this bit to reset uart rx fifo</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>tx_flow_en</name>
              <description>Set this bit to enable uart tx hardware flow control</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>uart_loopback</name>
              <description>Set this bit to enable uart loopback test mode</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>txd_brk</name>
              <description>RESERVED, DO NOT CHANGE THIS BIT</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>sw_dtr</name>
              <description>sw dtr</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>sw_rts</name>
              <description>sw rts</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>stop_bit_num</name>
              <description>Set stop bit: 1:1bit  2:1.5bits  3:2bits</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>bit_num</name>
              <description>Set bit num:  0:5bits 1:6bits 2:7bits 3:8bits</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>parity_en</name>
              <description>Set this bit to enable uart parity check</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>parity</name>
              <description>Set parity check:  0:even 1:odd, UART CONFIG1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_CONF1</name>
          <addressOffset>0x24</addressOffset>
          <description>Set this bit to enable rx time-out function</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>rx_tout_en</name>
              <description>Set this bit to enable rx time-out function</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_tout_thrhd</name>
              <description>Config bits for rx time-out threshold,uint: byte,0-127</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_flow_en</name>
              <description>Set this bit to enable rx hardware flow control</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_flow_thrhd</name>
              <description>The config bits for rx flow control threshold,0-127</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>txfifo_empty_thrhd</name>
              <description>The config bits for tx fifo empty threshold,0-127</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rxfifo_full_thrhd</name>
              <description>The config bits for rx fifo full threshold,0-127</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_LOWPULSE</name>
          <addressOffset>0x28</addressOffset>
          <description>UART_LOWPULSE</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>lowpulse_min_cnt</name>
              <description>used in baudrate detect</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
