espressif/arduino-esp32/tools/ide-debug/svd/esp8266.svd
        <register>
          <name>UART_CONF1</name>
          <addressOffset>0x24</addressOffset>
          <description>Set this bit to enable rx time-out function</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>rx_tout_en</name>
              <description>Set this bit to enable rx time-out function</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_tout_thrhd</name>
              <description>Config bits for rx time-out threshold,uint: byte,0-127</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_flow_en</name>
              <description>Set this bit to enable rx hardware flow control</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rx_flow_thrhd</name>
              <description>The config bits for rx flow control threshold,0-127</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>txfifo_empty_thrhd</name>
              <description>The config bits for tx fifo empty threshold,0-127</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>rxfifo_full_thrhd</name>
              <description>The config bits for rx fifo full threshold,0-127</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_LOWPULSE</name>
          <addressOffset>0x28</addressOffset>
          <description>UART_LOWPULSE</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>lowpulse_min_cnt</name>
              <description>used in baudrate detect</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_HIGHPULSE</name>
          <addressOffset>0x2c</addressOffset>
          <description>UART_HIGHPULSE</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>highpulse_min_cnt</name>
              <description>used in baudrate detect</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_RXD_CNT</name>
          <addressOffset>0x30</addressOffset>
          <description>UART_RXD_CNT</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>rxd_edge_cnt</name>
              <description>used in baudrate detect</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_DATE</name>
          <addressOffset>0x78</addressOffset>
          <description>UART HW INFO</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>uart_date</name>
              <description>UART HW INFO</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART_ID</name>
          <addressOffset>0x7c</addressOffset>
          <description>UART_ID</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>uart_id</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WDT</name>
      <baseAddress>0x60000900</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00000080</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>WDT_CTL</name>
          <addressOffset>0x0</addressOffset>
          <description>WDT_CTL</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>Register</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WDT_OP</name>
          <addressOffset>0x4</addressOffset>
          <description>WDT_OP</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>Register</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WDT_OP_ND</name>
          <addressOffset>0x8</addressOffset>
          <description>WDT_OP_ND</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>Register</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WDT_RST</name>
          <addressOffset>0x14</addressOffset>
          <description>WDT_RST</description>
          <size>32</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>Register</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>
